In [4]:
import pandas as pd

df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace=True)
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2018-12-26 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2018-12-26 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2018-12-26 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2018-12-26 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2018-12-26 01:45:00,95327,15.120,False,Distribution

In [6]:
len(df)

1000

In [7]:
len(df.drop_duplicates())

1000

In [9]:
df.drop_duplicates(subset=["First Name"], keep="first")

len(df.drop_duplicates(subset=["First Name"], keep="first"))

201

In [11]:
df.drop_duplicates(subset=["First Name", "Team"], keep="last").head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1994-01-29,2018-12-26 18:48:00,58755,5.097,True,Marketing
937,Aaron,NaN,1986-01-22,2018-12-26 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2018-12-26 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2018-12-26 20:57:00,110194,14.727,True,Product
538,Adam,Male,2010-10-08,2018-12-26 21:53:00,45181,3.491,False,Human Resources

In [17]:
df.drop_duplicates(subset=["First Name", "Team"], inplace=True)

df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2018-12-26 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2018-12-26 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2018-12-26 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2018-12-26 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2018-12-26 11:59:00,71276,5.027,True,Human Resources